import React, {Component} from 'react';
import {Link, Redirect, withRouter} from 'react-router-dom';


class Regulations extends Component{


    render(){
        return(
            <div className="regulation-text">
                <p>При проходженні квестів на нашому інформаційному порталі ви дізнаєтеся про спеціальність 
        "Комп'ютерні науки". Вам буде забезпечено можливість познайомиться з трьома напрямками:</p>
        <ul>
        <li>Веб дизайн та веб-розробка</li>
        <li>Програмування</li>
        <li>Комп'ютерні мережі</li>
        </ul>
        <p>Для кожного напряму на кафедрі є свої дисципліни, які виховують з абітурієнта фахівця інформаційних 
        технологій. Для веб-дизайну це основи роботи в графічних редакторах, таких як: Adobe Photoshop, 
        CorelDRAW, Illustration, основи веб-розробки (HTML, CSS, PHP, JavaScript), робота з різними фреймворками 
        (Bootstrap, laravel, ASP.NET). Для програмування наявний широкий спект дисциплін, таких як: алгоритмізація 
        і програмування, теорія алгоритмів, об'єктно-орієнтоване програмування (С++), технологія розробки 
        кроссплатформенних додатків (Qt, STL, OpenGL), створення додатків для платформи Microsoft.Net (Windows Form, ADO .Net, ASP.NET).
         Для комп'ютерних мереж: побудова і адміністрування локальних і корпоративних комп'ютерних мереж.
          Під час проходження квестів ви ознайомитеся з кожним напрямком. Після цього вам буде надана можливість обрати свій 
          подальший шлях: ви можете спробувати попрацювати на імпровізованій фірмі або продовжити вдосконалювати свої навички.</p>
        
            </div>
        );
    }
}

export default Regulations;